const news = [{
        id: 1,
        date: '25.10.2023',
        title: 'До новых встреч, дорогие друзья!',
        img: 'assets/images/blog/photo_2023-04-29_23-57-46.jpg',
        text: 'Ну что, дорогие друзья! Наш проект подходит к концу. Мы выражаем большую признательность волонтёрам, партнёрам и всем - всем, кто помогал в реализации инклюзивных программ в рамках проекта!Уверены, дальше нас ждут еще более насыщенные мероприятия и интересные проекты! До новых встреч! \n#УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 2,
        date: '25.10.2023',
        title: 'Играем в "Кульбутто"',
        img: 'assets/images/blog/photo_2023-04-27_23-51-46.jpg',
        text: 'Игра "Кульбутто" - французская образовательная игра, берет свое начало с конца 19 - го начала 20 - го века.Название игры переводится с французского как« неваляшка», аналогично русскому« Ваньке - Встаньке».А задача игрока– управляя столом, который установлен на специальной подставке, закатить шарики по различным лункам. "Кульбутто" интересна как для детей, так и для взрослых и включена в спартакиады, турниры, а также в различные соревнования. #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 3,
        date: '25.10.2023',
        title: 'Уникальность НСИ в том, что они доступны для любых категорий граждан, любых возрастов ',
        img: 'assets/images/blog/photo_2023-04-27_00-59-57.jpg',
        text: 'Уникальность НСИ в том, что они доступны для любых категорий граждан, любых возрастов!Дети с ОВЗ могут обыграть взрослых соперников, что дает сильную мотивацию к систематическим занятиям и оттачиванию навыков для выхода во Всероссийские и международные соревнования! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 4,
        date: '25.10.2023',
        title: 'В доме общественных организаций прошли соревнования по адаптивным спортивным играм для детей с инвалидностью ',
        img: 'assets/images/blog/photo_2023-04-24_00-09-36.jpg',
        text: 'В доме общественных организаций прошли соревнования по адаптивным спортивным играм для детей с инвалидностью.Мероприятие проводилось в рамках проекта« Учись, играй, расти!»при финансовой поддержке Федерального агентства по делам молодежи.Основная цель– создание спортивно - инклюзивной площадки по настольным спортивным игам народов мира для детей с инвалидностью.Главным партнером проекта выступила АНО« Дарить  добро».На турнире были представлены игры народов мира, такие, как: джакколо, кульбутто, матрешка, тейбл - эластик, колесо да Винчи, мини - керлинг, бокс - хоккей и др.Участники соревнований смогли проверить свои способности, осваивая новые игры, показать свои навыки и побороться за призовые места. Как отметила куратор проекта Хандзарифа Хабаева, основное направление работы– социализация детей - инвалидов и их интеграция в активное общество.Успехи участников турнира были отмечены дипломами и памятными призами. #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },

    {
        id: 5,
        title: 'О нас пишут',
        img: 'assets/images/blog/photo_2023-04-22_22-57-00.jpg',
        text: 'Про нас пишут! Про миссию нашего проекта и соревнования по адаптивным спортивным играм народов мира читайте в этом выпуске! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 6,
        title: 'Играем в "Галактику"',
        img: 'assets/images/blog/photo_2023-04-15_23-00-21.jpg',
        text: 'Игры народов мира настолько увлекательны, что даже волонтеры не могут упустить возможности посоревноваться по игре "Галактика". Описание игры: играют от 2 - х до 4 - х человек.На игровую конструкцию подвешены двенадцать шаров.У каждого игрока 6 игровых шаров(при игре вчетвером) меньшего диаметра и шпажка. Ход игры: игроки по очереди, по часовой стрелке, насаживают по одному игровому шару на шпажку и складывают их на подвес, таким образом, чтобы ни один из шаров не упал.Игра продолжается до тех пор, пока не выпадет хоть один игровой шар из конструкции.Тот игрок, от чьих манипуляций выпал шар, считается проигравшим. #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 7,
        title: 'Анонс финальных соревнований по настольным спортивным играм "',
        img: 'assets/images/blog/photo_2023-04-12_22-31-41.jpg',
        text: 'Друзья, рады анонсировать финальные соревнования по  настольным спортивным играм!На турнирах будут представлены игры народов мира, такие как: джакколо, кульбутто, матрешка, тейбл - эластик, колесо да Винчи, мини - керлинг, бокс - хоккей и др., по которым участники смогут показать свои навыки и побороться за призовые места! Ждем всех желающих! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 8,
        title: 'Нам любые возрасты покорны',
        img: 'assets/images/blog/photo_2023-04-08_19-15-29.jpg',
        text: 'Настольные спортивные игры народов мира дают возможность не только социализации и оздоровления игрокам с ОВЗ, но и способствуют привлечению к физической активности людей всех возрастов и любого уровня подготовки.Игры улучшают моторику, быстроту действий, учат строить стратегии и предугадывать действия соперника. #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 9,
        title: 'Игра "Монтесори"',
        img: 'assets/images/blog/photo_2023-04-05_22-27-12.jpg',
        text: 'Игра "Монтесори", развивающая логическое и стратегическое мышление, которая является очень распространенной и известной во всём мире благодаря своим несложным правилам и быстроте их изучения. Цель игры заключается в том, чтобы разместить 4 фишки одного цвета в один ряд вертикально, горизонтально, либо по диагонали.Правила похожи на крестики нолики, только поле игры значительно больше. Игроки, по очереди, опускают фишки своего цвета в пазы вверху игрового поля. Окончанием игры считается, если один из игроков разместил на поле в ряд 4 или больше фишек своего цвета(вертикаль, горизонталь, диагональ). #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 10,
        title: 'Игра «10 шаров»',
        img: 'assets/images/blog/photo_2023-04-03_22-29-10.jpg',
        text: 'Игра «10 шаров» хорошо известна благодаря телевизионному проекту« Форт Боярд». Главная задача игры - собрать ряд из цветных шариков, точно повторяющий шаблонный. Ход игры: Мастер игры на 5 секунд показывает участникам шаблонный ряд.После чего закрывает его крышкой.Участники должны воспроизвести ряд по памяти.Первый сделавший ошибку участник, считается проигравшим. #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 11,
        title: 'Путешествуем по РСО-Алания',
        img: 'assets/images/blog/photo_2023-03-29_23-41-12.jpg',
        text: 'Наш проект путешествует по РСО-Алания! Отрадно, что в процессе реализации проекта у команды и партнёров появляются идеи, которые делают наши программы интереснее и насыщеннее! Участники нашего проекта совместно с АНО "Дарить добро" организовали мобильную площадку по адаптивным спортивным играм в высокогорном поселении Задалеск! Насладились игрой и природными красотами не только наши маленькие участники, но и их родители! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 12,
        title: 'Играем в Корнхол',
        img: 'assets/images/blog/photo_2023-03-28_23-54-28.jpg',
        text: 'Одна из самых любимых игр наших участников в рамках проекта "Учись, играй, расти" - игра Корнхол! Правила довольно просты: необходимо с расстояния 3 метров забросить мешочек с крупой в лузу, расположенную на наклонной доске(игровом поле).Забросил мешочек в отверстие– получи 3 балла.Промахнулись и мешочек остался на игровом поле– получи 1 бал.Причём, в последнем случае, баллы начисляются, если мешочек сумел удержаться!А так как поверхность игрового поля скользкая, это удаётся сделать далеко не всегда!  #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 13,
        title: 'Играем в бокс хоккей',
        img: 'assets/images/blog/photo_2023-03-27_23-13-34.jpg',
        text: 'Игра в бокс хоккей - одна из самых азартных и весёлых игр, цель которой клюшками забить шайбу в ворота противника, прогоняя шайбы через разделительные планки. Развивает не только реакцию и моторику у игроков, но и дарит яркие эмоции и настроение! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 14,
        title: 'Продолжает радовать своими мероприятиями по НСИ ',
        img: 'assets/images/blog/photo_2023-03-16_13-40-20.jpg',
        text: 'Проект "Учись, играй, расти!" продолжает радовать своими инклюзивными мероприятиями по спортивным играм народов мира! На занятиях участники познакомились с правилами игр, техникой, а также приняли участие в турнирах! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 15,
        title: 'Занятия по настольным спортивным играм народов мира',
        img: 'assets/images/blog/photo_2023-03-12_22-48-48.jpg',
        text: 'Сегодня в рамках проекта "Учись, играй, расти!", реализуемого при поддержке Федерального агентства по делам молодежи, прошли занятия по настольным спортивным играм народов мира!Участники познакомились с историей и правилами игр, а также поучаствовали в мини - турнирах. Благодарим команду проекта, волонтёров, а также АНО "Дарить Добро" в лице Хабаевой Х.Р.за содействие и оказание помощи в проведении соревнований! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 16,
        title: 'Поддержка партнеров проекта "Учись, играй, расти!"',
        img: 'assets/images/blog/photo_2023-03-06_23-12-50 (2).jpg',
        text: 'Любая реализация проекта невозможна без поддержки партнёров, разделяющих взгляды на решение той или иной ключевой проблемы, особенно если это касается такого важного вопроса как социализация людей с инвалидностью в активную среду.Именно поэтому нашими« якорными» партнерами без преувеличения можно назвать Федерацию настольных спортивных игр России (ФНСИР) и АНО« Дарить Добро» в лице Хабаевой Х.Р., которая является первой организацией в РСО - Алания активно тиражирующей и использующей инновационные методики и практики по реабилитации детей и молодежи с ОВЗ посредством проведения мероприятий по настольным спортивным играм народов мира(НСИ). Также не можем не отметить СОРО БО« РЦДИИД« Алания», Общественную палату РСО - Алания, Всероссийское общественное движение« Волонтеры - медики» за неоценимую помощь в реализации социально значимых проектов по адаптации молодежи с ОВЗ и инвалидностью в активное общество посредством проведения инклюзивных мероприятий по НСИ! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 17,
        title: 'Скорость, ловкость и быстрота реакции',
        img: 'assets/images/blog/photo_2023-03-01_20-44-30.jpg',
        text: 'Скорость, ловкость и быстрота реакции - вот главный секрет успеха в эластике.Эта настольная игра появилась в Ирландии в прошлом веке и сразу полюбилась азартным участникам.Правила простые: с помощью эластичной резинки нужно забить все фишки в прорезь на барьере поля, чтобы они попали на другую сторону стола.Темп участники выбирают сами: кто - то медленно прицеливается, стараясь попасть точно в арку, а кто - то ускоряет темп, чтобы обыграть противников!А какую игру выберешь ты ? #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 18,
        title: '"Разные возможности - равная игра!"',
        img: 'assets/images/blog/photo_2023-02-01_12-33-30.jpg',
        text: '"Разные возможности - равная игра!", именно так звучит девиз нашего проекта "Учись, играй, расти!". ✅ Мы убеждены в том, что только посредством проведения совместных (инклюзивных) мероприятий возможно достичь главной цели - вовлечения людей с разными физическими возможностями в активную жизнь общества!✅Настольные спортивные игры России, как инновационная форма физкультурно - оздоровительной и спортивной деятельности, способствует объединению общественного пространства инвалидов и здоровых людей, разрушению социальных барьеров и изменению отношения общества к молодежи с инвалидностью на спортивных объектах! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
    {
        id: 19,
        title: 'Cтартует проект "Учись, играй, расти!"',
        img: 'assets/images/blog/photo_2022-11-01_18-20-21.jpg',
        text: 'Дорогие друзья!В этом месяце стартует проект "Учись, играй, расти!", направленный на вовлечение в активную среду детей с ОВЗ и инвалидностью через досуговые и спортивные мероприятия. В рамках проекта будут проходить: обучающие мастер - классы, тренировки, мини - турниры и соревнования.Итоговым результатом работы площадок станет создание юношеской Лиги по настольным спортивным играм для детей с ОВЗ и инвалидностью, что позволит интегрировать талантливых спортсменов нашей республики в региональные и международные соревнования! Будем ждать всех желающих на наших площадках! Более подробную информацию будем публиковать на нашем канале, поэтому следите за новостями, чтобы ничего не упустить! #УчисьИграйРасти #Росмолодежь #РосмолодежьГранты #АноДаритьДобро #ФНСИР'
    },
]



const showModalButtons = document.querySelectorAll('.read-more')


showModalButtons.forEach((btn, index) => {

    btn.addEventListener('click', (evt) => {
        evt.preventDefault()
        document.querySelector('.page').style.overflow = ''
        const html = document.getElementById('modal')
        html.innerHTML = createCard(news[index])
        html.style.display = 'flex'
        html.querySelector('.modal__inner').classList.add('open')
        document.body.style.overflow = 'hidden'
        let scroll = calcScroll()
        document.body.style.marginRight = scroll + 'px'

        html.addEventListener('click', ev => {
            if (ev.target.classList.contains('modal__overlay') || ev.target.classList.contains('modal__close') || ev.target.classList.contains('modal__close-item')) {
                html.style.display = 'none'
                document.body.style.overflow = ''
                document.body.style.marginRight = ''
            }
        })
    })

})

function createCard(obj) {
    return `
    <div class="modal__overlay"></div>
    <div class="modal__inner">
        <button class="modal__close" type="button">
<span class="modal__close-item"></span>
</button>
        <h4 class="modal__title">${obj.title}</h4>
        <time class="modal__date">${obj?.date || ''}</time>
        <div class="modal__img">
            <img src="${obj.img}" alt="qwe">
        </div>
        <p class="modal__text">${obj.text}</p>
    </div>
    `
}

function calcScroll() {
    let div = document.createElement('div')
    div.style.width = '50px'
    div.style.height = '50px'
    div.style.overflowY = 'scroll'
    div.style.visibility = 'hidden'
    document.body.appendChild(div)

    let scrollWidth = div.offsetWidth - div.clientWidth
    div.remove()

    return scrollWidth
}
